frontend/modules/fisher/controllers/DefaultController.php

SELECT `oc_country`.`name` AS `country_name`, `oc_zone`.`name` AS `zone_name`, `oc_address`.* FROM `oc_customer` LEFT JOIN `oc_address` ON oc_customer.address_id = oc_address.address_id LEFT JOIN `oc_country` ON oc_address.country_id = oc_country.country_id LEFT JOIN `oc_zone` ON oc_address.zone_id = oc_zone.zone_id WHERE `oc_customer`.`customer_id`='23'
SELECT *, `oc_country`.`name` AS `country_name`, `oc_zone`.`name` AS `zone_name` FROM `oc_address` LEFT JOIN `oc_country` ON oc_address.country_id = oc_country.country_id LEFT JOIN `oc_zone` ON oc_address.zone_id = oc_zone.zone_id WHERE `oc_address`.`customer_id`='23'
---
    public function actionContinue($project)
    {

        $items = ItemCart::find()->where(['customer_id' => Yii::$app->user->identity->id])->all();
        $model = Project::find()->where(['_id' => $project])->one();
        $user = User::find()->where(['_id' => Yii::$app->user->identity->id])->one();


        $customer_id = base64_decode($user->customer_id);

        $query = new Query;
        $query  ->select(['*','oc_country.name AS country_name','oc_zone.name AS zone_name'])
                ->from('oc_address')
                ->leftJoin('oc_country','oc_address.country_id = oc_country.country_id')
                ->leftJoin('oc_zone','oc_address.zone_id = oc_zone.zone_id')
                ->where(
                    [
                        'oc_address.customer_id'=> base64_decode($user->customer_id)

                    ])
                ->one();

        $command = $query->createCommand();
        $address = $command->queryAll();




        $query2 = new Query;
        $query2  ->select(['oc_country.name AS country_name','oc_zone.name AS zone_name','oc_address.*'])
                ->from('oc_customer')
                ->leftJoin('oc_address','oc_customer.address_id = oc_address.address_id')
                ->leftJoin('oc_country','oc_address.country_id = oc_country.country_id')
                ->leftJoin('oc_zone','oc_address.zone_id = oc_zone.zone_id')
                ->where(
                    [
                        'oc_customer.customer_id'=>$customer_id,

                    ])
                ->one();