frontend/modules/fisher/controllers/ProjectController.php

    public function actionView($id)
    {
        $user = User::find()->where(['_id' => Yii::$app->user->identity->id])->one();

        $customer_id = base64_decode($user->customer_id);

        $query2 = new Query;
        $query2  ->select(['oc_country.name AS country_name','oc_zone.name AS zone_name','oc_address.*'])
                ->from('oc_customer')
                ->leftJoin('oc_address','oc_customer.address_id = oc_address.address_id')
                ->leftJoin('oc_country','oc_address.country_id = oc_country.country_id')
                ->leftJoin('oc_zone','oc_address.zone_id = oc_zone.zone_id')
                ->where(
                    [
                        'oc_customer.customer_id'=>$customer_id,

                    ])
                ->one();
---
SELECT `oc_country`.`name` AS `country_name`, `oc_zone`.`name` AS `zone_name`, `oc_address`.* FROM `oc_customer` LEFT JOIN `oc_address` ON oc_customer.address_id = oc_address.address_id LEFT JOIN `oc_country` ON oc_address.country_id = oc_country.country_id LEFT JOIN `oc_zone` ON oc_address.zone_id = oc_zone.zone_id WHERE `oc_customer`.`customer_id`='23'

    public function actionReview($id)
    {


        $user = User::find()->where(['_id' => Yii::$app->user->identity->id])->one();

        $customer_id = base64_decode($user->customer_id);

        $query2 = new Query;
        $query2  ->select(['oc_country.name AS country_name','oc_zone.name AS zone_name','oc_address.*'])
                ->from('oc_customer')
                ->leftJoin('oc_address','oc_customer.address_id = oc_address.address_id')
                ->leftJoin('oc_country','oc_address.country_id = oc_country.country_id')
                ->leftJoin('oc_zone','oc_address.zone_id = oc_zone.zone_id')
                ->where(
                    [
                        'oc_customer.customer_id'=>$customer_id,

                    ])
                ->one();
---
SELECT `oc_country`.`name` AS `country_name`, `oc_zone`.`name` AS `zone_name`, `oc_address`.* FROM `oc_customer` LEFT JOIN `oc_address` ON oc_customer.address_id = oc_address.address_id LEFT JOIN `oc_country` ON oc_address.country_id = oc_country.country_id LEFT JOIN `oc_zone` ON oc_address.zone_id = oc_zone.zone_id WHERE `oc_customer`.`customer_id`='23'

    public function actionPlace($id)
    {
        $user = User::find()->where(['_id' => Yii::$app->user->identity->id])->one();

        $customer_id = base64_decode($user->customer_id);

        $query2 = new Query;
        $query2  ->select(['oc_country.name AS country_name','oc_zone.name AS zone_name','oc_address.*'])
                ->from('oc_customer')
                ->leftJoin('oc_address','oc_customer.address_id = oc_address.address_id')
                ->leftJoin('oc_country','oc_address.country_id = oc_country.country_id')
                ->leftJoin('oc_zone','oc_address.zone_id = oc_zone.zone_id')
                ->where(
                    [
                        'oc_customer.customer_id'=>$customer_id,

                    ])
                ->one();
---
SELECT `oc_country`.`name` AS `country_name`, `oc_zone`.`name` AS `zone_name`, `oc_address`.* FROM `oc_customer` LEFT JOIN `oc_address` ON oc_customer.address_id = oc_address.address_id LEFT JOIN `oc_country` ON oc_address.country_id = oc_country.country_id LEFT JOIN `oc_zone` ON oc_address.zone_id = oc_zone.zone_id WHERE `oc_customer`.`customer_id`='23'